const reviewname =document.querySelector(".reviewname");
const reviews =document.querySelector(".reviews");
const btnpre=document.querySelector(".btnpre");
const btnnext =document.querySelector(".btnnext");

const mayby=["Review by Htet Zhan","Review by Thin Yanant Kyaw","Review by Ko Nyein Maung","Review by Tun Tun Soe"];

const mayreviews=["လေနုအေးသည် တနွဲ့နွဲ့နော့နေဆဲကို' အဲ့စာပိုဒ်လေးနဲ့အစပြုခဲ့တဲ့ မေဟာ စာပေလောကထဲကိုအတော်ဂယက်ထခဲ့တယ်လို့ဆိုတယ် ဘာလို့လဲဆိုတော့ မြန်မာစာမှာ လေနုအေးဆိုတဲ့ စကားမရှိလို့ပါတဲ့ စာရေးဆရာဟာ မေဝတ္ထုမှာ လေနုအေး၊အပြုံး စတဲ့စကားလုံးအသစ်တွေကို ဖန်တီးခဲ့လို့ရယ် မေဝတ္ထုဟာ မြန်မာ့ယဥ်ကျေးမှုနဲ့သွေဖယ်နေလို့ရယ်ကြောင့် အတော်လေးဝေဖန်ခံခဲ့ရပါတယ် နောက်ပြီး စာရေးဆရာဟာ သူကိုယ်တိုင်ဖန်တီးခဲ့တဲ့ လေနုအေးဆိုတဲ့စကားလုံးကိုအဓိပ္ပါယ် နားမလည်ဘဲရမ်းသန်းသုံးကြလို့နောက်ပိုင်းမှာ အတော်ရွံရှာခဲ့တယ်လို့ဆိုတယ် သခင်ဗဟိန်းကတော့ မေဝတ္ထုကိုဖတ်ရသည်မှာ ရှမ်ပိန်သောက်ရသလိုပဲလို့ ဆိုတယ် ဘာလို့လဲတော့ ဖတ်ရင်းဖတ်ရင်း ရှိန်းခနဲ ဖိန်းခနဲ့ ခံစားသွားရလို့ပါတဲ့.. ကဲပါ မေ ဆိုတဲ့အမျိုးသမီးအကြောင်းဆက်ကြပါစို့... မေဟာ အင်္ဂလိပ်စာတတ် စန္ဒယားတီးကျွမ်းကျင်တဲ့ ရုပ်ရည်လှပတဲ့ မိဘမဲ့အမျိုးသမီးတယောက်ပေါ့ မေ့ကိုဆရာမြသန်းတင့်က ကလက်သော ချောသော ရိုးသော လွယ်သော ခေတ်ဆန်သော မေ လို့ မှတ်ချက်ပြုထားတယ်၊ မေဟာ လူကုံထံအသိုင်းဝိုင်းကို အထင်မကြီးသလိုလိုနဲ့ ထိုအသိုင်းဝိုင်းထဲဝင်ဆန့်ချင်တဲ့အမျိုးသမီးတယောက်လို့ ဆိုရလိမ့်မယ် သမာဓိမြို့ဝန် ဦးဘေမောင်ရဲ့စိတ်ကိုစမ်းရင်း ငွေညစ်ရာကနေ အပျိုစင်ဘဝကိုပေးခဲ့ရတယ် ဒါပေမယ့် မေက မေပါပဲ သူ့ကိုတန်ဖိုးထားချစ်မြတ်နိုးတဲ့ ကိုကျော်မြင့်နဲ့လက်ထပ်ပြီး ပြည့်စုံတဲ့ဘဝရောက်ရပေမယ့် မတင်းတိမ်နိုင်တဲ့ မေ ရ မ္မ-က်ကြီးတဲ့ မေ လွှတ်တော်အမတ်ကအစ လမ်းဘေးက ကလေကချေနဲ့ပါ မကင်းနိုင်တဲ့မေ တကယ်တော့ မေဟာ...သူ့ဘဝသူရွေးချယ်ပြီး သူလုပ်ချင်တာကိုလုပ်သွားတဲ့ အမျိုးသမီးတယောက်ပါပဲသခင်ဗဟိန်းပြောတဲ့ ဖတ်ရင်းနဲ့ရှိန်းခနဲ့ ဖိန်းခနဲဆိုတဲ့ ခံစားချက်မျိုးက ဘယ်လိုလဲဆိုတာ...မေဝတ္ထုဖတ်ရင်း ခံစားကြည့်လိုက်ပါ..,"
,"မေဝတ္ထုကို ဆရာဒဂုန်တာရာ ကျောင်းသားဘဝက နိုင်ငံခြားဝတ္ထုတစ်ခုကို မြန်မာမှုပြုပြီး ရေးခဲ့ပါတယ်။ အဲဒီ့ခေတ်က သတ်မှတ်ထားတဲ့ မြန်မာယဥ်ကျေးမှု စံနှုန်းတွေနဲ့ မေ ဟာ လုံးဝဖီလာဆန့်ကျင်နေလို့ ဝေဖန်ခံရတဲ့ စာအုပ်ပါ။မေဟာ အထက်တန်းလွှာအသိုင်းအဝိုင်းကို တစ်ဖက်က လှောင်ပြောင်ကဲ့ရဲ့ချင်ပေမယ့် တစ်ဖက်က အထင်ကြီးပြီး လူကုံထန်အသိုင်းအဝိုင်းမှာ ကျင်လည်ချင်နေပြန်တယ်။ မိဘမဲ့ဖြစ်ပေမယ့် အင်္ဂလိပ်စကား ကျွမ်းကျွမ်းကျင်ကျင် ပြောတတ်တဲ့၊ စန္ဒရားတီးတတ်တဲ့၊ ရုပ်လှတဲ့ မေအတွက် အဲဒီအသိုင်းအဝိုင်းကို တိုးဝင်ဖို့ မခဲယဥ်းပါဘူး။သူစာသင်ပေးနေတဲ့အိမ်က မိန်းမကွယ်ရာမှာ အကဲစမ်းချင်နေတဲ့ ဦးဘေမောင်ရဲ့ စိတ်ဓာတ်ကို အသုံးချပြီး ငွေညစ်ရာက သူလိုချင်တဲ့ ငွေသုံးရာကို အရှက်နဲ့လဲခဲ့ရပါတယ်။ (အဲဒီ့ခေတ်က ငွေသုံးရာက နည်းမှ မနည်းပဲကိုး) သူ့ကို တန်ဖိုးထားပြီးချစ်တဲ့ ကိုကျော်မြင့်ကို လက်ထပ်ပြီး ရောက်ချင်တဲ့အသိုင်းအဝိုင်းကို ရောက်ခဲ့ပေမယ့် မေတစ်ယောက် မလိမ္မာပြန်ဘူး။ ရမ္မက်ကြီးပြီး ပတ်ဝန်းကျင်ကို သိပ်ဂရုမစိုက်တတ်တဲ့မေဟာ အောက်လွှတ်တော်အမတ် ဦးဘညွှန့်နဲ့ မကင်းသလို လမ်းဘေးက ဘသိန်းနဲ့လဲ မကင်းပြန်ပေ။ သနားစရာကောင်းတဲ့ ဇာတ်ကောင်အဖြစ်ကနေ ရွံရှာစက်ဆုပ်စရာကောင်းတဲ့ ဇာတ်ကောင်အဖြစ် ခုန်ဆင်းခဲ့တာ မေကိုယ်တိုင်ပါပဲ။ သားတစ်ယောက်ကိုမွေးပြီး မိခင်စိတ်ဖြစ်လာတဲ့အခါ နောင်တရပြီး အမှန်ကိုပြင်ဖို့ ကြိုးစားခဲ့ပေမယ့် နောက်ကျသွားပြီဖြစ်တဲ့ မေ့အတွက် <br>အကောင်းကိုရှာသည်၊ အကောင်းကားမရှိ<br>ဆရာ့ရဲ့ ပွင့်လင်းပြီး ရဲတင်းတဲ့ အရေးအသားတွေနဲ့အတူ သခင်ဗဟိန်းပြောသလို ဝိုင်တစ်ခွက်ကိုသောက်ရသလို ခံစားရမှာဖြစ်ပါတယ်။",
"မေဟာ ချစ်စရာကောင်းတယ်ဒါပေမယ့် မုန်၊းဖို့လည်းကောင်းတယ်မေဟာ ဆွဲဆောင်မှုရှိတယ်ဒါပေမယ့် စိတ်ကုန်ဖို့လည်းကောင်းတယ်မေဟာ သနားစရာကောင်းတယ်ဒါပေမယ့် ရွှ ံရှာဖို့လည်း ကောင်းတယ် မေဟာ အရိုင်၊းဆန်တယ်တစ်ဆက်တည်းမှာပဲ သိပ်ကိုဖြူစင်နေတယ်ကျွန်တော်အတွက်တော့ မေဟာဆန့်ကျင်ဖက်ဖြစ်စေတဲ့ ခံစားမှုရသမျိူးကိုတပြိုင်နက်တည်း ပေးတဲ့ စာအုပ်တစ်အုပ်ဒီစာအုပ်ဟာ ဆရာကြီးရဲ့ ဘဝမှာ သိပ်ကို အရေးပါတဲ့စာအုပ်တစ်အုပ်ဖြစ်ခဲ့သလို မေရဲ့ သမိုင်းဟာ အရမ်းကိုစိတ်ဝင်စားစရာကောင်းတဲ့ စာအုပ်တစ်အုပ်လည်းဖြစ်တယ်မေကို ဆရာဟာ သူ့ပိုက်ဆံနဲ့သူစိုက်ပြီးပုံနှိပ်ခဲ့တယ် ဒါပေမယ့် အရင်းတောင်ပြန်မရလို့ ကျောင်းနားလိုက်ရတဲ့ထိဖြစ်ခဲ့ဘူးသေးတယ် စာအုပ်ထွက်လာတော့လည်း စာပေလောကိုဆူပွက် ရိုက်ခတ်သွားစေတဲ့ စာအုပ်တစ်အုပ်ဆိုလည်းမမှားဘူး စာရေးဆရာများစွာရဲ့ သရော်မှုတွေဝေဖန်ကဲ့ရဲ့မှုတွေကို တစ်ဝကြီးခံလာရတဲ့ စစ်အတွင်းက ကောင်မလေးတစ်ယောက်ဆိုလည်းမမှားဘူးဗျာ ဘာလို့ဆို မေရဲ့ အရိုင်၊းဆန်မှုတွေနဲ့ ဆရာရဲ့ စကားလုံးသစ်တီထွင်ကြံဆမှုတွေက စာပေလောကနဲ့မသက်ဆိုင်ဘူးလို့ ထင်ကြတဲ့အတွက်ကြောင့်ပဲသို့ပေမယ့် သူတို့မေ့နေသည့်အချက်ကားမေဟာ ဆရာရဲ့ ကိုယ်ပိုင်ရေးဝတ္ထုမဟုတ်ဘဲ Beverley Nichols ရဲ့ self ဝတ္ထုကို မှီငြမ်းပြီး မြန်မာမှုပြုထားတာကိုပဲဆရာရဲ့ ဘာသာပြန်စွမ်းရည်ဟာသိပ်ကို စွမ်းတာကြောင့် ပင်ကိုရေးတစ်အုပ်လိုပင်ထင်ဟပ်နေတဲ့ အတွက်ကြောင့် ဖြစ်တယ်အထက်ပါအချက်များက ဒဂုန်တာရာ ရဲ့မေကို လေ့လာခြင်း -မောင်သာမည ရေးထားတဲ့အထဲကမှကျနော်သဘောကျတဲ့ အချက်တိုလေးတွေကိုကောက်နုတ်ထားတာဖြစ်ပါတယ်ဒီစာအုပ်ဟာ အားကိုးရာ တစ်စုံတစ်ယောက်မှမရှိတဲ့ တစ်ကောင်ကြွက် မိန်းကလေးတစ်ယောက်ရဲ့ ဘဝကို ဘယ်လိုဖြတ်သန်းရတယ်ဘယ်လိုတွေ့ကြုံရလည်းဆိုတာကိုအခြေခံပြီးရေးထားတဲ့ စာအုပ်တစ်အုပ်ပါ"
,"မတတ်နိုင်ဘူး မေ.....ချစ်လာတာကိုဘယ်လိုလုပ်ပြီး တားလို့ရမလဲ။အသည်းနှစ်လုံးကြားထဲက ပွင့်လာတဲ့ မေတ္တာပန်းကို မပွင့်နဲ့၊ မဖူးနဲ့လို့ ပြောလို့ရမလား မေ ရယ်...။ မေကိုတွေ့ပြီးကတည်းမှ နေလို့မရဘူး။ မေ့ကို ကိုကျော်မြင့် ဝမ်းထဲမှာ ထားလို့ကို မရလို့ပါမေ--။"];

let currentIndex =0;

btnpre.addEventListener("click",()=>{
        currentIndex=(currentIndex +1+mayby.length )%mayby.length;
        update();
});

btnnext.addEventListener("click",()=>{
        currentIndex=(currentIndex +1)%mayby.length;
        update();
});



function update(){
        reviewname.innerHTML=mayby[currentIndex];
        reviews.innerHTML=mayreviews[currentIndex];
        
}
